#include "integer.h"
#include "inputs.h"

int menuInteger()
  {
	  printf("1. %s\n", "Ввод целых чисел");
	  printf("2. %s\n", "Вывод целых чисел");
	  printf("3. %s\n", "Абсолютная величина числа");
	  printf("4. %s\n", "Определение положительности числа");
	  printf("5. %s\n", "Изменение знака");
	  printf("6. %s\n", "Преобразование натурального в целое");
	  printf("7. %s\n", "Преобразование целого неотрицательного в натуральное");
	  printf("8. %s\n", "Сложение");
	  printf("9. %s\n", "Вычитание");
	  printf("10. %s\n", "Умножение");
	  printf("11. %s\n", "Частное от деления");
	  printf("12. %s\n", "Остаток от деления");
	  printf("13. %s\n", "Возврат в меню");
	  return enterIntNumInterval(1, 13);
  }
