#include "natural.h"
#include "stdio.h"

void menuNatural()
  {
  printf ("1. %s\n", "Сравнение чисел");
  printf ("2. %s\n", "Проверка на равенство нулю");
  printf ("3. %s\n", "Добавление единицы");
  printf ("4. %s\n", "Сложение");
  printf ("5. %s\n", "Вычитание");
  printf ("6. %s\n", "Умножение на цифру");
  printf ("7. %s\n", "Умножение на 10 в степени k");
  printf ("8. %s\n", "Умножение чисел");
  printf ("9. %s\n", "Вычитание числа, умноженного на цифру");
  printf ("10. %s\n", "Вычисления первой цифры деления большего \
          натурального на меньшее, домноженное на 10^k");
  printf ("11. %s\n", "Частное от деления");
  printf ("12. %s\n", "Остаток от деления");
  printf ("13. %s\n", "НОД двух чисел");
  printf ("14. %s\n", "НОК двух чисел");
  printf ("15. %s\n", "Возврат в меню");
  printf ("%s", "Выберите действие: ");
  }


