#include "integer.h"
#include "stdio.h"

void menuInteger()
  {
  printf ("1. %s\n", "Абсолютная величина числа");
  printf ("2. %s\n", "Определение положительности числа");
  printf ("3. %s\n", "Умножение числа на -1");
  printf ("4. %s\n", "Преобразование натурального в целое");
  printf ("5. %s\n", "Преобразование целого неотрицательного в натуральное");
  printf ("6. %s\n", "Сложение");
  printf ("7. %s\n", "Вычитание");
  printf ("8. %s\n", "Умножение");
  printf ("9. %s\n", "Частное от деления");
  printf ("10. %s\n", "Остаток от деления");
  printf ("11. %s\n", "Возврат в меню");
  printf ("%s", "Выберите действие: ");
  }
